packerlschupfer/esp32-boiler-controller/src/main.cpp
    // Modbus components back to INFO
    #ifndef MODBUSDEVICE_DEBUG
        logger.setTagLevel("ModbusD", ESP_LOG_INFO);
        logger.setTagLevel("ModbusDevice", ESP_LOG_INFO);
    #endif
    
    #ifndef ESP32MODBUSRTU_DEBUG
        logger.setTagLevel("ModbusRTU", ESP_LOG_INFO);
    #endif
    
    // Network components
    #ifdef ETH_DEBUG
        logger.setTagLevel("ETH", ESP_LOG_DEBUG);
        logger.setTagLevel("EthernetManager", ESP_LOG_DEBUG);
        logger.setTagLevel("NetworkMonitor", ESP_LOG_DEBUG);
        logger.setTagLevel("sys_evt", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("ETH", ESP_LOG_INFO);
        logger.setTagLevel("EthernetManager", ESP_LOG_INFO);
        logger.setTagLevel("NetworkMonitor", ESP_LOG_INFO);
        logger.setTagLevel("sys_evt", ESP_LOG_INFO);
    #endif
    
    // OTA components
    #ifdef OTA_DEBUG
        logger.setTagLevel("OTAMgr", ESP_LOG_DEBUG);
        logger.setTagLevel("OTAManager", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("OTAMgr", ESP_LOG_INFO);
        logger.setTagLevel("OTAManager", ESP_LOG_INFO);
    #endif
    
    // Task Manager
    #ifdef TASK_MANAGER_DEBUG
        logger.setTagLevel("TaskManager", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("TaskManager", ESP_LOG_INFO);
    #endif
    
    // Temperature sensor
    #ifdef ANDRTF3_DEBUG
        logger.setTagLevel("ANDRTF3", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("ANDRTF3", ESP_LOG_INFO);
    #endif
    
    // Monitoring - adjust based on debug flag
    #ifdef MONITOR_TASK_DEBUG
        logger.setTagLevel("MonitoringTask", ESP_LOG_DEBUG);
        logger.setTagLevel("MON", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("MonitoringTask", ESP_LOG_INFO);
        logger.setTagLevel("MON", ESP_LOG_INFO);
    #endif
    
    LOG_INFO(TAG, "Normal logging levels restored");
    #endif
}